{
  "profile_picture": "/assets/img/profile.jpg",
  "first_name": "Asad",
  "last_name": "Mahmood",
  "email_address": "amahmood1@uiowa.edu",
  "mobile_number": "(319) 512-5163",
  "resume_path": "/assets/resume.pdf",
  "description": "I am a Senior Software Engineer with a Masters in Computer Science from <a href=\"https://cs.uiowa.edu/\">The University of Iowa</a>. My experience from working at companies like Amazon, GSK and Clinical Ink; spans across various domains of software development, machine learning, and academic research. Currently, I am working as a Full Stack Software Developer, predominantly using Python for backend development and JavaScript for frontend. I am also actively exploring LLMs and ChatBots and how they can be used to increase productivity and improve experience across fields.",
  "linkedIn": "https://www.linkedin.com/in/asad1996172/",
  "Github": "https://github.com/asad1996172",
  "Twitter": "https://twitter.com/asad177mahmood",
  "Medium": "https://asad1996172.medium.com/",
  "highlights": {
    "JUNE 2023": "Started full-time as Senior Software Engineer at Clinical Ink.",
    "MARCH 2023": "Started full-time as Software Engineer at Propay.",
    "JULY 2022": "Started full-time as Software Development Engineer at Amazon.",
    "JULY 2021": "Started full-time as an AI/ML Engineer at GSK.",
    "MAY 2021": "Completed Masters in Computer Science from The University of Iowa.",
    "JULY 2020": "Virtually presented a paper at ACL Main Conference 2020.",
    "MAY 2020": "Started Internship as AI/ML Engineer at GSK.",
    "APR 2020": "Our paper titled \"A Girl Has A Name: Detecting Authorship Obfuscation\" got published in ACL 2020.",
    "JAN 2020": "Served as an external reviewer in PoPETs 2020.",
    "SEPT 2019": "Achieved 6th position out of 55 submissions at PAN 2019, for model detecting Humans vs Bots on Twitter.",
    "JUL 2019": "Presented our paper at PoPETs in Stockholm, Sweden.",
    "JUN 2019": "Our paper titled \"A Girl Has No Name: Automated Authorship Obfuscation using Mutant-X\" got published in PoPETs.",
    "AUG 2018": "Joined The University of Iowa for Masters in Computer Science.",
    "MAY 2018": "Graduated from FAST NU (Lahore Campus).",
    "AUG 2017": "Joined LUMS as a Research Assistant under Dr. Fareed Zaffar.",
    "JUN 2017": "Joined TPI LUMS as a ROR Web Developer Intern.",
    "SEPT 2016": "Joined FASTCARE Lahore Chapter as a lead Graphic Designer.",
    "MAR 2016": "Joined NUCES ACM Lahore Chapter as a Graphic Designer.",
    "AUG 2014": "Started Bachelor's in Computer Science from FAST NU (Lahore Campus)."
  }
}
