{
  "experiences": [
    {
      "job_title": "Senior Software Engineer",
      "image": "./assets/img/cink.jpeg",
      "company": "Clinical Ink",
      "description": "Senior Software Engineer for the BrainBaseline Core Platform team. Day-to-day work involves:",
      "projects": [
        "Data report and analysis for insights from clinical trial mobile applications",
        "Working with GitLab, Python, AWS, Snowflake, JIRA"
      ],
      "dates": "June 2023 - Present"
    },
    {
      "job_title": "Software Engineer",
      "image": "./assets/img/propay.jpeg",
      "company": "ProPay",
      "description": "Worked on the following things as part of the software engineering team:",
      "projects": [
        "Developed and maintained a member-based platform using PHP and the Laravel framework, allowing seamless signup for services and automated fee payments.",
        "Worked on a Unified payment platform, enhancing the user experience by enabling members to pay fees using multiple payment options through a consistent user interface and a standardized set of APIs.",
        "Leveraged Python and Kafka to optimize communication between services, exploring the replacement of the existing SQS method, resulting in significantly faster and more efficient data transfer.",
        "Optimized and revamped UI screens for a Flutter-based mobile application."
      ],
      "dates": "March 2023 - June 2023"
    },
    {
      "job_title": "Software Development Engineer (SDE)",
      "image": "./assets/img/amazon.png",
      "company": "Amazon",
      "description": "Worked on the following things as part of Physical Stores team:",
      "projects": [
        "React based frontend and Java based backend to provide receipt lookup feature for mobile wallet launch in 3P physical stores.",
        "Bringing up an internal service in Singapore region using pipelines.",
        "AWS services including CloudFormation, CloudWatch, DynamoDB, OpenSearch, API Gateway, Lambda etc."
      ],
      "dates": "July 2022 - March 2023"
    },
    {
      "job_title": "AI/ML Engineer - NLP",
      "image": "./assets/img/gsk.png",
      "company": "GlaxoSmithKline (GSK)",
      "description": "Worked on the following things in Knowledge Graph Project:",
      "projects": [
        "React based frontend application using typescript. This app contained a search engine, Named Entity Recognition (NER) and Relation Extraction (RE) data collection tool and a trained model comparison tool. Semantic UI react function based components were used for frontend and Recoil JS was used to maintain state in the app.",
        "Python Django based backend following Repository Design Pattern, that provided all the necessary APIs to different teams.",
        "NLP Pipeline consisting of different microservices which communicated using Kafka. These microservices were deployed on a Kubernetes cluster managed by Rancher. I used Kafka Exporter to monitor the progress of NLP Pipeline on a Grafana dashboard. I also scaled the processing capacity of NLP Pipeline from 4000 docs/week to 1.5 mil docs/week.",
        "Storing the NLP Pipeline annotated documents in Neo4J graph database (upto 26 billion nodes and 27 billion relations) and used Cypher Query Language (CQL) for queries."
      ],
      "dates": "July 2021 - July 2022"
    },
    {
      "job_title": "AI/ML Engineer Intern",
      "image": "./assets/img/gsk.png",
      "company": "GlaxoSmithKline (GSK)",
      "description": "Worked under Anne Cocos on tasks related to Information Extraction and Machine Learning which include:",
      "projects": [
        "Designing and implementing a pipeline for fine-tuning BioBERT on Named Entity Recognition (NER) task.",
        "Adding BioBERT models in the existing information extraction pipeline and comparing its performance with SciSpacy.",
        "Adding Metamap Entity Linking to existing API."
      ],
      "dates": "May 2020 - August 2020"
    },
    {
      "job_title": "Teaching Assistant",
      "image": "./assets/img/uiowa.png",
      "company": "The University of Iowa",
      "description": "Duties include checking assignments and leading a discussion session. Courses include:",
      "projects": [
        "Computer Science Fundamentals",
        "Object Oriented Software Development",
        "Informatics Project",
        "Health Data Analytics",
        "Research Methods in Human Computer Interaction"
      ],
      "dates": "January 2019 - May 2021"
    },
    {
      "job_title": "Graduate Research Assistant",
      "image": "./assets/img/uiowa.png",
      "company": "The University of Iowa",
      "description": "Research revolves around using Natural Language Processing and Machine Learning to enhance user privacy. Projects include:",
      "projects": [
        "Mutant-X: An automated authorship obfuscation tool made using sentiment preserving word embeddings and genetic algorithms (GAs).",
        "Twitter Humans v Bots: A SVM based predictive model which, given a tweet, can classify it as written by human or bot with an accuracy of 91%.",
        "Obfuscation Detection: A tool which uses the power or pre-trained language models like BERT and GPT-2 to detect whether a given text is Obfuscated or not."
      ],
      "dates": "August 2018 - September 2020"
    },
    {
      "job_title": "Research Assistant",
      "image": "./assets/img/lums.png",
      "company": "Lahore University of Management Sciences (LUMS)",
      "description": "Worked under Dr. Fareed Zaffar on projects related to Data Science and Machine Learning. Projects include:",
      "projects": [
        "Reverse Image Search tool using pre-trained VGG-19 and google's, im2txt model.",
        "Automated detection of in-appropriate video content on YouTube Kids.",
        "Enhancement of the ad-verification system for OLX Pakistan.",
        "In-game analysis of soccer matches through a proprietary dataset of events and tracking data of 6000 soccer matches across four different leagues."
      ],
      "dates": "August 2017 - March 2018"
    },
    {
      "job_title": "Web Developer Intern",
      "image": "./assets/img/tpi.jpeg",
      "company": "Technology for People Initiative (TPI) LUMS",
      "description": "Worked as a backend Web Developer on a ROR based dataset visualization tool called Statistan using NoSQL (MongoDB).",
      "projects": [],
      "dates": "June 2017 - July 2017"
    }
  ]
}
