{
    "experiences": [
        {
            "job_title": "Graduate Research Assistant",
            "image": "./assets/img/uiowa.png",
            "company": "The University of Iowa",
            "description": "Research revolves around using Natural Language Processing and Machine Learning to enhance user privacy. Projects include:",
            "projects": [
                "Mutant-X: An automated authorship obfuscation tool made using sentiment preserving word embeddings and genetic algorithms (GAs).",
                "Twitter Humans v Bots: A SVM based predictive model which, given a tweet, can classify it as written by human or bot with an accuracy of 91%.",
                "Obfuscation Detection: A tool which uses the power or pre-trained language models like BERT and GPT-2 to detect whether a given text is Obfuscated or not."
            ],
            "dates": "August 2018 - Present"
        },
        {
            "job_title": "Teaching Assistant",
            "image": "./assets/img/uiowa.png",
            "company": "The University of Iowa",
            "description": "Duties include checking assignments and leading a discussion session. Courses include:",
            "projects": [
                "Computer Science Fundamentals",
                "Object Oriented Software Development",
                "Informatics Project"
            ],
            "dates": "January 2019 - Present"
        },
        {
            "job_title": "AI/ML Engineer Intern",
            "image": "./assets/img/gsk.png",
            "company": "GlaxoSmithKline (GSK)",
            "description": "Worked under Anne Cocos on tasks related to Information Extraction and Machine Learning which include:",
            "projects": [
                "Designing and implementing a pipeline for fine-tuning BioBERT on Named Entity Recognition (NER) task.",
                "Adding BioBERT models in the existing information extraction pipeline and comparing its performance with SciSpacy.",
                "Adding Metamap Entity Linking to existing API."
            ],
            "dates": "May 2020 - August 2020"
        },
        {
            "job_title": "Research Assistant",
            "image": "./assets/img/lums.png",
            "company": "Lahore University of Management Sciences (LUMS)",
            "description": "Worked under Dr. Fareed Zaffar on projects related to Data Science and Machine Learning. Projects include:",
            "projects": [
                "Reverse Image Search tool using pre-trained VGG-19 and google's, im2txt model.",
                "Automated detection of in-appropriate video content on YouTube Kids.",
                "Enhancement of the ad-verification system for OLX Pakistan.",
                "In-game analysis of soccer matches through a proprietary dataset of events and tracking data of 6000 soccer matches across four different leagues."
            ],
            "dates": "August 2017 - March 2018"
        },
        {
            "job_title": "Web Developer Intern",
            "image": "./assets/img/tpi.jpeg",
            "company": "Technology for People Initiative (TPI) LUMS",
            "description": "Worked as a backend Web Developer on a ROR based dataset visualization tool called Statistan using NoSQL (MongoDB).",
            "projects": [],
            "dates": "June 2017 - July 2017"
        }
    ]
}